# DisplacedElementDisplacementY Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DisplacedElementDisplacementY Property
ParameterTypeId Class See Also
---
"Y Displacement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DisplacedElementDisplacementY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisplacedElementDisplacementY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DisplacedElementDisplacementY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace